#include<stdio.h>
#include<stdlib.h>
#include<string.h>
//数组指针联系一维数组和二维数组
void main()
{
	int(*p)[5];
	int a[5] = { 1, 2, 3, 4, 5 };
	int b[4][5] = {1,2,2,3,4,4,5,8,5,6,7,7,7,8,88,8,9,9,19,20};
	int  i = 0, j = 0;
	//数组指针与一维数组
	p = &a;
	for (i = 0; i < 5;i++)
	{
		printf("%d ",(*p)[i]);  //*p即p[0]表示指向第一块存储有5个整型数据的内存块，但是还不知道指向这整个内存块中的第几个元素，而这又由[i]来表示
	}
	

	printf("\n");
	//数组指针与二维数组的联系
	
	p = b;                      //p[0]指向第一块存储有5个整型数据的内存块，p[1]指向第二块存储有5个整型数据的内存块……依次类推
	for (i = 0; i < 4;i++)
	{
		for (j = 0; j < 5;j++)
		{
			printf("%d ",p[i][j]);
		}
	}
	system("pause");
}

//总结：二维数组名的本质是一个常量数组指针

